def mojave?
  `sw_vers`.match /\s10\.14/
end

tap "basecamp/private", "git@github.com:basecamp/homebrew-private.git"

cask_args appdir: "/Applications"

brew "37"
brew "flashlight"
brew "work"

brew "fish"
brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "prettyping"
brew "bat"
brew "awscli"
brew "the_silver_searcher"
brew "tldr"
brew "wireguard-tools"
brew "youtube-dl"
brew "flac"
brew "diff-so-fancy"
brew "hub"
brew "curl"
brew "wget"
brew "readline"
brew "jsonpp"
brew "jq"
brew "libdvdread"
brew "mkvtoolnix"
brew "tree"
brew "httpie"

brew "rbenv"
brew "rbenv-default-gems"
brew "ruby-build"
brew "ant"
cask "java"
brew "leiningen"
brew "go"
brew "typescript"
brew "python"
brew "node"
brew "yarn"
brew "elixir"
brew "ghc"

brew "mysql"
brew "postgresql"

cask "1password"
cask "spotify"
cask "visual-studio-code"
cask "encryptme"
cask "docker"
cask "snagit"
cask "viscosity"
cask "sketch"
cask "makemkv"
cask "firefox"
cask "gifox"
cask "spectacle"
cask "keybase"

tap "homebrew/cask-fonts"

cask "font-bitter"
cask "font-fira-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-karla"
cask "font-lato"
cask "font-lora"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-roboto-condensed"
cask "font-signika"
cask "font-signika-negative"
